Config/Documents/ПереводСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПереводСотрудника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадровыеПеремещения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/ПереводСотрудника/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Не СотрудникВШтатеНаСервере(Объект.Сотрудник) Тогда
			
			Сообщить("Сотрудник """ + Объект.Сотрудник + """ не в штате!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СотрудникВШтатеНаСервере(Сотрудник)
	
	Возврат СотрудникВШтате(Сотрудник);
	    
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ДанныеСотрудника =  ПолучитьДанныеСотрудникаССервераПоСсылке(Объект.Сотрудник);
	
	Если ДанныеСотрудника = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Объект.Подразделение = ДанныеСотрудника.Подразделение;
	Объект.Должность = ДанныеСотрудника.Должность;
	Объект.Оклад = ДанныеСотрудника.Оклад;
	Объект.Дата = ТекущаяДата();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСотрудникаССервераПоСсылке(СотрудникСсылка)
		
	Возврат ПолучитьДанныеСотрудникаПоСсылке(СотрудникСсылка);
	
КонецФункции
